let додавання = 0.1 + 0.2 ;
console.log(додавання.toFixed(2));
alert (`Результат: ${додавання.toFixed(2)}`);

let рядок = "1";
let цифра = 2;
let результат = +рядок + цифра;
// let результат = Number(рядок) + цифра;
alert (`Результат додавання = ${результат}`);
console.log (`Результат додавання = ${результат}`);

let обсягФлешки = prompt('Вкажіть обсяг памяті на флешці, Гб:');
const розмірФайлу = 820;
let кількістьФайлів = обсягФлешки / розмірФайлу;
console.log (`На дану флешку поміститься ${кількістьФайлів.toFixed(1)} файлів, розміром по 820Гб`);
alert(`На дану флешку поміститься ${кількістьФайлів.toFixed(1)} файлів, розміром по 820Гб`);

let сума = prompt('Введіть суму грошей у гаманці, грн:');
let ціна = prompt('Ціна шоколадки, грн:');
let кількість = сума/ціна;
let остача = сума%ціна;
alert(`Кількість шоколадок за ціною ${ціна}грн - ${кількість.toFixed(1)}шоколадок, здача становить ${остача}грн`);
console.log(`Кількість шоколадок за ціною ${ціна}грн - ${кількість.toFixed(1)}шоколадок, здача становить ${остача}грн`);

let депозит = prompt('Вкажіть суму депозиту, грн:');
let місяців = prompt('Кількість місяців вкладення');
const процентнаСтавка = 0.05/12; /*за місяць*/
let відсотки = депозит*процентнаСтавка*місяців;
alert(`Нараховані відсотки з депозиту за ${місяців}міс. становить: ${відсотки.toFixed(2)}грн`);
console.log(`Нараховані відсотки з депозиту за ${місяців}міс. становить: ${відсотки.toFixed(2)}грн`);

let x = 2 && 0 && 3;
console.log (x);

let y = 2 || 0 || 3;
console.log (y);

let n = 2 && 0 || 3;
console.log (n);

